ednieuw/Arduino-ESP32-Nano-Wordclock/Old/ESP32_WordClockV132/ESP32_WordClockV132.ino
//--------------------------------------------                                                 
// TIME Set system time to compile time using RTCLIB
//--------------------------------------------
// void SetSystemTimeToCompileTimeRTCLIB(void)
// {
//  DateTime CompileTime = DateTime(F(__DATE__), F(__TIME__));                                   // Store strings in flash memory
//  struct timeval Tv = { .tv_sec = (time_t) CompileTime.unixtime(), .tv_usec = 0 };
//  settimeofday(&Tv, NULL);
//  sprintf(sptext, "System time set to compile time: %s %s", __DATE__, __TIME__);
//  Tekstprintln(sptext);
// }

//--------------------------------------------                                                 
// TIME Set system time to compile time using basic functions
//--------------------------------------------
void SetSystemTimeToCompileTime(void)
{
 struct tm Tm;
 time_t Now;
 
 const char* MonthNames = "JanFebMarAprMayJunJulAugSepOctNovDec";                             // Parse __DATE__ and __TIME__ macros
 char MonthStr[4];
 sscanf(__DATE__, "%d %s %d", &Tm.tm_mday, MonthStr,  &Tm.tm_year);                           // Parse "08 Nov 2025"
 sscanf(__TIME__, "%d:%d:%d", &Tm.tm_hour, &Tm.tm_min, &Tm.tm_sec);                           // Parse "14:30:45"
 Tm.tm_year -= 1900;                                                                          // Years since 1900
 Tm.tm_mon = (strstr(MonthNames, MonthStr) - MonthNames) / 3;                                 // Month 0-11
 Tm.tm_isdst = -1;                                                                            // Auto-determine DST
 Now = mktime(&Tm);                                                                           // Convert to time_t
 struct timeval Tv = { .tv_sec = Now, .tv_usec = 0 };
 settimeofday(&Tv, NULL);                                                                     // Set system time
 sprintf(sptext, "System time set to compile time: %s %s", __DATE__, __TIME__);
 Tekstprintln(sptext);
}

//--------------------------------------------------------------------
// TIME Get current time from best available source
//--------------------------------------------------------------------
time_t GetTijd(bool printit)
{
  if (Mem.UseDS3231 && DS3231Installed)     { GetDS3231Time(false);  }
  else if (Mem.NTPOn && WiFi.isConnected()) { getLocalTime(&timeinfo);  }
  else  {    time(&now);                      localtime_r(&now, &timeinfo);  }
  time_t t = mktime(&timeinfo);
  if (printit) PrintRTCTime();
  return t;
}

//--------------------------------------------------------------------
// NTP Return local time as RTClib DateTime
//--------------------------------------------------------------------
DateTime GetLocalDateTime(){ return DateTime(GetTijd(false));}

//--------------------------------------------------------------------
// NTP print the NTP time for the timezone set 
//--------------------------------------------------------------------
void GetNTPtime(bool printit)
{
  sntp_set_sync_mode(SNTP_SYNC_MODE_IMMED);  // Immediate sync mode
  sntp_restart();                            // Triggers a fresh sync
  getLocalTime(&timeinfo);
  if (printit) PrintNTPtime();
}

//--------------------------------------------------------------------
// NTP Print current local (NTP) time
//--------------------------------------------------------------------
void PrintNTPtime(void)
{
  getLocalTime(&timeinfo);
  PrintRTCTime();
}

//--------------------------------------------------------------------
// NTP print the NTP UTC time 
//--------------------------------------------------------------------
void PrintUTCtime(void)
{
  time(&now);
  struct tm* UTCtime = gmtime(&now);
  sprintf(sptext, "UTC: %02d:%02d:%02d %02d-%02d-%04d",
          UTCtime->tm_hour, UTCtime->tm_min, UTCtime->tm_sec,
          UTCtime->tm_mday, UTCtime->tm_mon + 1, UTCtime->tm_year + 1900);
  Tekstprint(sptext);
}

// //--------------------------------------------                                                //
// // DS3231 Init module  -moved to ->  void InitTimeSystem(void)
// //--------------------------------------------
// void InitDS3231Mod(void)
// {
//  DS3231Installed = IsDS3231I2Cconnected();                                                    // Check if DS3231 is connected and working   
//  sprintf(sptext,"External RTC module %s found", DS3231Installed?"IS":"NOT");
//  RTCklok.begin();     
//  Tekstprintln(sptext);                                                             
// }
//--------------------------------------------------------------------
// DS3231 check for I2C connection
// DS3231_I2C_ADDRESS (= often 0X68) = DS3231 module
//--------------------------------------------------------------------
bool IsDS3231I2Cconnected(void)
{
  for (byte i = 1; i < 120; i++)
  {
    Wire.beginTransmission(i);
    if (Wire.endTransmission() == 0 && i == DS3231_I2C_ADDRESS)
      return true;
  }
  return false;
}

//--------------------------------------------------------------------
// DS3231 temperature
//--------------------------------------------------------------------
float GetDS3231Temp(void)
{
  Wire.beginTransmission(DS3231_I2C_ADDRESS);
  Wire.write(0x11);
  Wire.endTransmission();
  Wire.requestFrom(DS3231_I2C_ADDRESS, 2);

  if (Wire.available())
  {
    byte tMSB = Wire.read();
    byte tLSB = Wire.read();
    return (tMSB & 0b01111111) + ((tLSB >> 6) * 0.25);
  }
  return -273.0;
}

//--------------------------------------------------------------------
// DS3231 RTC ESP32 -> DS3231
// Set time in module DS3231
//--------------------------------------------------------------------
void SetDS3231Time(void)
{
  DateTime tNow(timeinfo.tm_year + 1900, timeinfo.tm_mon + 1, timeinfo.tm_mday,
                timeinfo.tm_hour, timeinfo.tm_min, timeinfo.tm_sec);
  RTCklok.adjust(tNow);
  Tekstprint("Time set in DS3231 RTC module: ");
  PrintDS3231Time();
  if(!Mem.UseDS3231 && !Mem.NTPOn ) Tekstprintln("*** Not using DS3231");
}

//--------------------------------------------------------------------
// DS3231 reads time in module DS3231
// and store it in Word clock time structure
//--------------------------------------------------------------------
void GetDS3231Time(bool printit)
{
  DateTime Inow = RTCklok.now();
  timeinfo.tm_year = Inow.year() - 1900;
  timeinfo.tm_mon  = Inow.month() - 1;
  timeinfo.tm_mday = Inow.day();
  timeinfo.tm_hour = Inow.hour();
  timeinfo.tm_min  = Inow.minute();
  timeinfo.tm_sec  = Inow.second();
  if (printit) PrintDS3231Time();
}

//--------------------------------------------------------------------
// DS3231 Print DS3231 time
//--------------------------------------------------------------------
void PrintDS3231Time(void)
{
 DateTime Inow = RTCklok.now();
 sprintf(sptext, "%02d/%02d/%04d %02d:%02d:%02d ",
          Inow.day(), Inow.month(), Inow.year(),
          Inow.hour(), Inow.minute(), Inow.second());
 Tekstprintln(sptext);
}

//--------------------------------------------                                                //
// RTC prints the ESP32 internal RTC time to serial
//--------------------------------------------
void PrintRTCTime(void)
{
 sprintf(sptext,"%02d/%02d/%04d %02d:%02d:%02d ", 
     timeinfo.tm_mday,timeinfo.tm_mon+1,timeinfo.tm_year+1900,
     timeinfo.tm_hour,timeinfo.tm_min,timeinfo.tm_sec);
 WTekstprint(sptext,"<!--"," -->");                                                         // Hide the time on the HTML page <!-- This text won't appear at all -->
 Tekstprintln("");
}

//--------------------------------------------                                                //
// RTC Fill sptext with time
//--------------------------------------------
void PrintTimeHMS(){ PrintTimeHMS(2);}                                                        // print with linefeed
void PrintTimeHMS(byte format)
{
 sprintf(sptext,"%02d:%02d:%02d",timeinfo.tm_hour,timeinfo.tm_min,timeinfo.tm_sec);
 switch (format)
 {
  case 0: break;
  case 1: Tekstprint(sptext); break;
  case 2: Tekstprintln(sptext); break;  
 }
}

//--------------------------------------------                                                //
// RTC Set time in ESP32 using global timeinfo struct
//--------------------------------------------
void SetRTCTime(void) 
{ 
 time_t t = mktime(&timeinfo);                                                                // t= unixtime
 SetSystemTime(t);
}

//--------------------------------------------                                                //
// RTC Set RTC time using Unix timestamp
//--------------------------------------------
void SetSystemTime(time_t t)
{ 
  struct timeval tv = { .tv_sec = t, .tv_usec = 0 };
  settimeofday(&tv, nullptr);
  localtime_r(&t, &timeinfo);
  Tekstprint("ESP32 RTC time set: ");
  PrintTimeHMS();
  Displaytime(); 
}

//--------------------------------------------                                                //
// CLOCK Print all the times available 
//--------------------------------------------
void PrintAllClockTimes(void)
{
 Tekstprint("\n Clock time: ");
 PrintRTCTime();
 if(WiFi.localIP()[0] != 0)                                                                   // If no WIFI then no NTP time printed
   {
    Tekstprint("   NTP time: ");
    PrintNTPtime();
   }
 if(DS3231Installed)
   {
    Tekstprint("DS3231 time: ");
    PrintDS3231Time();
   }
}
//--------------------------- End Time functions --------------------------

//--------------------------------------------                                                //
//  CLOCK Convert Hex to uint32
//--------------------------------------------
uint32_t HexToDec(const String& hexString) {
    uint32_t decValue = 0;

    for (size_t i = 0; i < hexString.length(); i++) 
       {
        char c = hexString.charAt(i);
        uint8_t value = 0;
        if      (c >= '0' && c <= '9') { value = c - '0';      } 
        else if (c >= 'A' && c <= 'F') { value = c - 'A' + 10; } 
        else if (c >= 'a' && c <= 'f') { value = c - 'a' + 10; } 
        else { continue;                                                                      // Skip invalid characters
        }
        decValue = (decValue << 4) | value;                                                   // Multiply by 16 and add value
    }
    return decValue;
}
//------------------------------------------------------------------------------              //
// CLOCK Demo mode
//------------------------------------------------------------------------------
void Demomode(void)
{
 if ( millis() - msTick == 10)  SetNanoLED13(0);                                              // Turn OFF the second on pin 13
 if ( millis() - msTick >= MilliSecondValue)                                                  // Flash the onboard Pin 13 Led so we know something is happening
 {    
  msTick = millis();                                                                          // second++; 
  SetNanoLED13(100);                                                                          // Turn ON the second on pin 13
  if( ++timeinfo.tm_sec >59) { timeinfo.tm_sec = 0; }
  if( ++timeinfo.tm_min >59) { timeinfo.tm_min = 0; timeinfo.tm_sec = 0; timeinfo.tm_hour++;}
  if( timeinfo.tm_hour >24) timeinfo.tm_hour = 0;                                             // If hour is after 12 o'clock 
  DimLeds(false);
  SetSecondColour();                                                                          // Set the colour per second of 'IS' and 'WAS' 
  Displaytime();
  Tekstprintln("");
  SerialCheck();
 }
}
//------------------------------------------------------------------------------              //
// CLOCK Fire display on MATRIX_HEIGHT MATRIX_WIDTH
//------------------------------------------------------------------------------
void FireMode(void)
{
  Fire2023_2D();
  SerialCheck();
}
//--------------------------------------------                                                //
// FIRE
//--------------------------------------------
// ==== FIRE EFFECT SETTINGS ====
#define COOLING     90
#define SPARKING    40
#define FIRE_DELAY  50

uint8_t heat[MATRIX_HEIGHT][MATRIX_WIDTH];  // 2D heat map
//--------------------------------------------                                                //
// FIRE Utils
//--------------------------------------------
uint8_t clamp_sub(uint8_t val, uint8_t sub) { return (val > sub) ? (val - sub) : 0;}
uint8_t clamp_add(uint8_t val, uint8_t add) { return (val + add > 255) ? 255 : (val + add);}
void HeatColor(uint8_t temperature, uint8_t &r, uint8_t &g, uint8_t &b) 
{
 uint8_t t192 = (temperature * 192) / 255;
 uint8_t heatramp = (t192 & 0x3F) << 2;
 if      (t192 > 128) { r = 255;      g = 255;      b = heatramp; } 
 else if (t192 > 64)  { r = 255;      g = heatramp; b = 0;        } 
 else                 { r = heatramp; g = 0;        b = 0;        }
}

