ednieuw/Arduino-ESP32-Nano-Wordclock/Old/ESP32_WordClockV132/ESP32_WordClockV132.ino
//============================================
// IR-RECEIVER Internal function - handles recognition mode
// Validates remote address Calls RecognizeButton
//============================================
void ProcessRecognitionMode(decode_type_t protocol, uint16_t command, uint16_t address)
{
  if (address != IRMem.learnedRemoteAddress || 
     protocol != (decode_type_t) IRMem.learnedRemoteProtocol)                                 // Check if it's from the learned remote
  {
    sprintf(sptext, "⚠ Ignored - Wrong remote (Address: 0x%04X)", address);
    if (address!=0) Tekstprintln(sptext);                                                     // Stray input detected
  }
  else {RecognizeButton(protocol, command, address);  }                                       // Correct remote - identify which button was pressed
}

//--------------------------------------------                                                //
// IR-RECEIVER Initializes learning mode
// Resets all button data, Prompts for first button
//--------------------------------------------
void StartIRLearning()
{
 Tekstprintln("\n=== Starting Learning Mode ===");
 currentLearningIndex = 0;
 learningMode = true;
 IRMem.remoteIdentified = false;
 for (int i = 0; i < NOOFBUTTONS; i++) {IRMem.buttons[i].learned = false; }
 sprintf(sptext, "Please press button: %s", ButtonNames[0].c_str());
 Tekstprintln(sptext);
}

//--------------------------------------------                                                //
// IR-RECEIVER Shows learned buttons
//--------------------------------------------
void PrintAllMappings(void)
{
 if (!IRMem.remoteIdentified) {Tekstprintln("No remote learned yet!");  return; }
 PrintLine(35);
 sprintf(sptext, "IR-Remote Address: 0x%04X", IRMem.learnedRemoteAddress);
 Tekstprintln(sptext);
 sprintf(sptext, "IR-Remote Protocol: %s", getProtocolString( (decode_type_t) IRMem.learnedRemoteProtocol));
 Tekstprintln(sptext);
 PrintLine(35);
  for (int i = 0; i < NOOFBUTTONS; i++)
  {
   if (IRMem.buttons[i].learned)
    {
     sprintf(sptext, "%s\t-> Cmd: 0x%04X", ButtonNames[i].c_str(), IRMem.buttons[i].command);
     Tekstprintln(sptext);     
    }
  }
 PrintLine(35);
}

//--------------------------------------------                                                //
// IR-RECEIVER Reset all settings
//--------------------------------------------
void ResetAllIRremoteSettings()
{
 Tekstprintln("\n=== Resetting All IR remote Data ===");
 IRMem.remoteIdentified = false;
 IRMem.learnedRemoteAddress = 0;
 IRMem.learnedRemoteProtocol = 0;
 for (int i = 0; i < NOOFBUTTONS; i++)
  {
    IRMem.buttons[i].learned = false;
    IRMem.buttons[i].protocol = 0;
    IRMem.buttons[i].command = 0;
    IRMem.buttons[i].address = 0;
  }
  
  StoreIRRemoteInFlashMemory();
  Tekstprintln("✓ IR remote reset complete.");   
  learningMode = false;
}


//--------------------------------------------                                                //
// IR-RECEIVER Identifies button pressed
//--------------------------------------------
int RecognizeButton(decode_type_t protocol, uint16_t command, uint16_t address)
{
  bool found = false;
  for (int i = 0; i < NOOFBUTTONS; i++)
  {
    if (IRMem.buttons[i].learned && 
        IRMem.buttons[i].protocol == (uint8_t)protocol &&
        IRMem.buttons[i].command == command && 
        IRMem.buttons[i].address == address)
    {
      sprintf(sptext, "Button pressed: %s", ButtonNames[i].c_str());
      Tekstprintln(sptext);
      found = true;
      ReworkIRremoteValue(i);
      return i;
    }
  }
  
  if (!found)
  {
    sprintf(sptext, "Unknown button - Protocol: %s, Command: 0x%04X, Address: 0x%04X", getProtocolString(protocol), command, address);
    Tekstprintln(sptext);
    ReworkIRremoteValue(-1);
    return -1;
  } 
 return -1;
}

//--------------------------------------------                                                //
// IR-RECEIVER ReworkRemoteValue
// String ButtonNames[] = {"0", "1", "2", "3", "4", "5", "6", "7", "8", "9",
//                        "UP", "DOWN", "LEFT", "RIGHT", "POWER", "OK"};
//  Button "POWER" and "ONOFF" can work without POWER ON
//--------------------------------------------
void ReworkIRremoteValue(int ButtonNamesNr)
{
 String ButtonName = ButtonNames[ButtonNamesNr]; 
 String DisplayOption = "Q0";
 if (ButtonNamesNr == -1)  {Tekstprintln("Unknown button - ignored");  return;  }

if (Mem.UseRotary == 3)
 {
 if (IR_PowerOnstate == false) // && ButtonNamesNr < 14 ) 
 {
 switch(ButtonNamesNr)
  {
    case 0: ReworkInputString("Q0");  break;                                                  // Button "0"
    case 1: ReworkInputString("Q1");  break;                                                  // Button "1"
    case 2: ReworkInputString("Q2");  break;                                                  // Button "2"
    case 3: ReworkInputString("Q3");  break;                                                  // Button "3"
    case 4: ReworkInputString("Q4");  break;                                                  // Button "4"
    case 5: ReworkInputString("Q5");  break;                                                  // Button "5"
    case 6: ReworkInputString("Q6");  break;                                                  // Button "6"
    case 7: ReworkInputString("Q7");  break;                                                  // Button "7"
    case 8: ReworkInputString("Q8");  break;                                                  // Button "8"
    case 9: ReworkInputString("Q9");  break;                                                  // Button "9"                                               // Turn displaychoice on
    case 10:                                                                                  // Button "UP"
    case 11:                                                                                  // Button "DOWN"
    case 12:                                                                                  // Button "LEFT"
    case 13:                                                                                  // Button "RIGHT"
            break;
    case 14:                                                                                  // Button "POWER"
            ToggleIRpower();
            break;
    case 15:                                                                                  // Button "OK"
            break;
    case 16:                                                                                  // Button "ONOFF"
            ReworkInputString("O");                                                           // Turn On OFF display
            break;
    default:
            sprintf(sptext, "Button '%s' not yet assigned", ButtonName.c_str());
            Tekstprintln(sptext);
            break;
  }
 }
 else
 {
 switch(ButtonNamesNr)
  {
    case 0 ... 9:                                                                                   // Button "0 - 9"
            EnteredDigits += ButtonName;                                                      // Add digit to entered string  
            if (EnteredDigits.length() > 6) {EnteredDigits = EnteredDigits.substring(0, 6); } // Limit to 6 digits (HHMMSS)
            if (EnteredDigits.length() == 6)
              {
               sprintf(sptext, "Time entered: %c%c:%c%c:%c%c (press OK)", 
                 EnteredDigits[0], EnteredDigits[1], EnteredDigits[2], 
                 EnteredDigits[3], EnteredDigits[4], EnteredDigits[5]);
              }
            else sprintf(sptext, "Digits: %s (Need 6 for HHMMSS)", EnteredDigits.c_str());
            Tekstprintln(sptext);
            break;
    case 10:                                                                                  // Button "UP"
            AdjustTime(1, 0, 0);                                                              // +1 hour
            break;
    case 11:                                                                                  // Button "DOWN"
            AdjustTime(-1, 0, 0);                                                             // -1 hour
            break;
    case 12:                                                                                  // Button "LEFT"
            AdjustTime(0, -1, 0);                                                             // -1 minute
            break;
    case 13:                                                                                  // Button "RIGHT"
            AdjustTime(0, 1, 0);                                                              // +1 minute
            break;
    case 14:                                                                                  // Button "POWER"
            ToggleIRpower();
            break;
    case 15: 
            learningMode = false;                                                             // Button "OK"
//          Serial.println(EnteredDigits.length());   
            if (EnteredDigits.length() == 6) {ReworkInputString(EnteredDigits); EnteredDigits = "";}
            else  { Tekstprintln("⚠ Need 6 digits (HHMMSS) before OK");  }
            break;
    case 16:                                                                                  // Button "ONOFF"
            ReworkInputString("O");                                                           // Turn On OFF display
            break;
    default:
            sprintf(sptext, "Button '%s' not yet assigned", ButtonName.c_str());
            Tekstprintln(sptext);
            break;
  }
 }
 }  // end if ==3

if (Mem.UseRotary == 4)                                                                      // {"MIN-1", "MIN+1","UUR-1","UUR+1","POWER","ONOFF"};
 {
 if (IR_PowerOnstate == false) // && ButtonNamesNr < 14 ) 
 {
 switch(ButtonNamesNr)
    {
    case 4:                                                                                   // Button "POWER"
            ToggleIRpower();
            break;
    case 5:                                                                                   // Button "ONOFF"
            ReworkInputString("O");                                                           // Turn On OFF display
            break;
    default:
            Tekstprintln("Turn On remote with POWER");
            break;
    }
  }
 else
   {
    switch(ButtonNamesNr)
     {
    case 0:                                                                                   // Button "MIN-1"
            AdjustTime(0, -1, 0);                                                             // -1 minute
            break;
    case 1:                                                                                   // Button "MIN+1"
            AdjustTime(0, 1, 0);                                                              // +1 minute
            break;
    case 2:                                                                                   // Button "UUR-1"
            AdjustTime(-1, 0, 0);                                                             // -1 hour
            break;
    case 3:                                                                                   // Button "UUR+1"
            AdjustTime(1, 0, 0);                                                              // +1 hour
            break;
    case 4:                                                                                   // Button "POWER"
            ToggleIRpower();
            break;
    case 5:                                                                                   // Button "ONOFF"
            ReworkInputString("O");                                                           // Turn On OFF display
            break;
    default:
            sprintf(sptext, "Button '%s' not yet assigned", ButtonName.c_str());
            Tekstprintln(sptext);
            break;
      }
   }
 } // end if ==4
}

//--------------------------------------------                                                //
// IR-RECEIVER Adjust current time by hours/minutes/seconds
//--------------------------------------------
void AdjustTime(int DeltaHours, int DeltaMinutes, int DeltaSeconds)
{
 timeinfo.tm_hour += DeltaHours;
 timeinfo.tm_min  += DeltaMinutes;
 timeinfo.tm_sec  += DeltaSeconds;
 //time_t t = 
 mktime(&timeinfo);
 if(DS3231Installed)   SetDS3231Time();
 Displaytime();       
}

//--------------------------------------------                                                //
// IR-RECEIVER Turn On or off Remote control
// Turns off after 60 seconds
//--------------------------------------------
void ToggleIRpower()
{
 static bool powerState = false;                                                              //
 powerState = !powerState;
 if (powerState)
  {
   IR_PowerOnstate = true;                                                                    // React on IR-remote input
   Tekstprintln("IR-remote is ON");
   IR_StartTime = millis();
  }
 else
  {
    Tekstprintln("IR-remote is OFF");
    IR_PowerOnstate = false;                                                                  // Do not react on IR-remote input
  } 
}